# colors.py

##########################################################################
# COULEURS DE BASE
##########################################################################

class Color:
    white = (255, 255, 255)
    black = (0, 0, 0)

    gray = (120, 120, 120)
    darkgray = (60, 60, 60)

    red = (255, 0, 0)
    green = (0, 255, 0)
    blue = (0, 120, 255)
    yellow = (255, 255, 0)
    orange = (255, 165, 0)
    cyan = (0, 255, 255)


##########################################################################
# COULEURS DU TRAFIC
#
# Plus il y a de voitures sur une case,
# plus la couleur devient chaude.
##########################################################################

traffic_colors = [
    (183, 228, 199),  # 0 voiture
    (183, 228, 199),  # 1 voiture
    (222, 230, 109),  # 2 voitures
    (255, 214, 102),  # 3 voitures
    (255, 183, 77),   # 4 voitures
    (255, 138, 51),   # 5 voitures
    (240, 84, 44),    # 6 voitures
    (214, 40, 40),    # 7 voitures
    (180, 0, 0)       # 8+ voitures
]

##########################################################################
# COULEURS DES TUILES DE LA MAP
##########################################################################

CITY_COLORS = {
    # Bâtiments / zones
    'B': (30, 31, 31),        # fond sombre
    'H': (79, 100, 158),      # habitation
    'W': (112, 74, 139),      # travail / bureaux
    'C': (127, 83, 49),       # centre-ville

    # Routes directionnelles
    '>': (65, 65, 65),
    '<': (65, 65, 65),
    '^': (65, 65, 65),
    'v': (65, 65, 65),

    # Carrefour
    'X': (80, 80, 80),

    # Passage piéton et feu
    'P': (230, 230, 230),
    'F': (65, 65, 65),

    # Entrée / sortie
    'E': (42, 82, 156),
    'S': (200, 45, 48),

    # Trottoir / espace libre
    ' ': (185, 163, 118),
}


##########################################################################
# COULEURS DES FEUX
##########################################################################

TRAFFIC_LIGHT_COLORS = {
    "GREEN": (0, 255, 0),
    "ORANGE": (255, 165, 0),
    "RED": (255, 0, 0)
}


##########################################################################
# COULEURS DES NPC
##########################################################################

VEHICLE_COLORS = [
    Color.red,
    Color.cyan,
    Color.yellow,
    Color.white,
]
VEHICLE_COLOR = Color.white
PEDESTRIAN_COLOR = (0, 255, 255)
